phonebook = {'Дядя Ваня': {'phones': ['+78002553535', '+79772562534'], 'BD': "12.11.1973", 'eMail': "gggg@yandex.ru"}}
print (phonebook['Дядя Ваня']['phones'][0])

sp = {'дядя коля': {'номер телефона': ['8-800-555-35-35', '8-900-536-35-35'], 'город': 'Сыктыфкар', 'Статус': 'дядя'},
      'нюрка': {'номер телефона': ['8-555-549-34-35'], 'город': 'Сыктыфкар', 'Статус': 'тетя'}}

while True:
    command = input('Введите команду: ')
    if command == '/all':
        print('Вот текущий список номеров')
        print(sp)
    elif command == '/add.contact':
        f = input('Введите имя нового контакта: ')
        if f in sp:
            print('Контакт существует!')
        else:
            coll = int(input('Сколько номеров вы хотите ввести: '))
            i = 0
            while coll > 0:
                n = input('Введите первый номер: ')
                sp[f]['номер телефона'][i] = n
                i += 1
                coll -= 1
        print('Номер добавлен в базу данных')
    elif command == '/help':
        print('Здесь какойто мануал')